RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle_reg.h
/**
  ******************************************************************************
  * @file    dsp2_middle_reg.h
  * @version V1.0
  * @date    2021-09-10
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DSP2_MIDDLE_REG_H__
#define __DSP2_MIDDLE_REG_H__

#include "bl808.h"

/* 0x224 : LSC_setting */
#define DSP2_MIDDLE_LSC_SETTING_OFFSET (0x224)
#define DSP2_MIDDLE_LSC_ON_W           DSP2_MIDDLE_LSC_ON_W
#define DSP2_MIDDLE_LSC_ON_W_POS       (8U)
#define DSP2_MIDDLE_LSC_ON_W_LEN       (1U)
#define DSP2_MIDDLE_LSC_ON_W_MSK       (((1U << DSP2_MIDDLE_LSC_ON_W_LEN) - 1) << DSP2_MIDDLE_LSC_ON_W_POS)
#define DSP2_MIDDLE_LSC_ON_W_UMSK      (~(((1U << DSP2_MIDDLE_LSC_ON_W_LEN) - 1) << DSP2_MIDDLE_LSC_ON_W_POS))
#define DSP2_MIDDLE_X_OFFSET_W         DSP2_MIDDLE_X_OFFSET_W
#define DSP2_MIDDLE_X_OFFSET_W_POS     (16U)
#define DSP2_MIDDLE_X_OFFSET_W_LEN     (8U)
#define DSP2_MIDDLE_X_OFFSET_W_MSK     (((1U << DSP2_MIDDLE_X_OFFSET_W_LEN) - 1) << DSP2_MIDDLE_X_OFFSET_W_POS)
#define DSP2_MIDDLE_X_OFFSET_W_UMSK    (~(((1U << DSP2_MIDDLE_X_OFFSET_W_LEN) - 1) << DSP2_MIDDLE_X_OFFSET_W_POS))
#define DSP2_MIDDLE_Y_OFFSET_W         DSP2_MIDDLE_Y_OFFSET_W
#define DSP2_MIDDLE_Y_OFFSET_W_POS     (24U)
#define DSP2_MIDDLE_Y_OFFSET_W_LEN     (8U)
#define DSP2_MIDDLE_Y_OFFSET_W_MSK     (((1U << DSP2_MIDDLE_Y_OFFSET_W_LEN) - 1) << DSP2_MIDDLE_Y_OFFSET_W_POS)
#define DSP2_MIDDLE_Y_OFFSET_W_UMSK    (~(((1U << DSP2_MIDDLE_Y_OFFSET_W_LEN) - 1) << DSP2_MIDDLE_Y_OFFSET_W_POS))

/* 0x228 : LSC_coeff_R_A */
#define DSP2_MIDDLE_LSC_COEFF_R_A_OFFSET (0x228)
#define DSP2_MIDDLE_R_ACOEFF_W           DSP2_MIDDLE_R_ACOEFF_W
#define DSP2_MIDDLE_R_ACOEFF_W_POS       (0U)
#define DSP2_MIDDLE_R_ACOEFF_W_LEN       (23U)
#define DSP2_MIDDLE_R_ACOEFF_W_MSK       (((1U << DSP2_MIDDLE_R_ACOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_ACOEFF_W_POS)
#define DSP2_MIDDLE_R_ACOEFF_W_UMSK      (~(((1U << DSP2_MIDDLE_R_ACOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_ACOEFF_W_POS))

/* 0x22C : LSC_coeff_R_BE */
#define DSP2_MIDDLE_LSC_COEFF_R_BE_OFFSET (0x22C)
#define DSP2_MIDDLE_R_BCOEFF_W            DSP2_MIDDLE_R_BCOEFF_W
#define DSP2_MIDDLE_R_BCOEFF_W_POS        (0U)
#define DSP2_MIDDLE_R_BCOEFF_W_LEN        (13U)
#define DSP2_MIDDLE_R_BCOEFF_W_MSK        (((1U << DSP2_MIDDLE_R_BCOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_BCOEFF_W_POS)
#define DSP2_MIDDLE_R_BCOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_R_BCOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_BCOEFF_W_POS))
#define DSP2_MIDDLE_R_ECOEFF_W            DSP2_MIDDLE_R_ECOEFF_W
#define DSP2_MIDDLE_R_ECOEFF_W_POS        (16U)
#define DSP2_MIDDLE_R_ECOEFF_W_LEN        (13U)
#define DSP2_MIDDLE_R_ECOEFF_W_MSK        (((1U << DSP2_MIDDLE_R_ECOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_ECOEFF_W_POS)
#define DSP2_MIDDLE_R_ECOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_R_ECOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_ECOEFF_W_POS))

/* 0x230 : LSC_coeff_R_CD */
#define DSP2_MIDDLE_LSC_COEFF_R_CD_OFFSET (0x230)
#define DSP2_MIDDLE_R_DCOEFF_W            DSP2_MIDDLE_R_DCOEFF_W
#define DSP2_MIDDLE_R_DCOEFF_W_POS        (0U)
#define DSP2_MIDDLE_R_DCOEFF_W_LEN        (23U)
#define DSP2_MIDDLE_R_DCOEFF_W_MSK        (((1U << DSP2_MIDDLE_R_DCOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_DCOEFF_W_POS)
#define DSP2_MIDDLE_R_DCOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_R_DCOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_DCOEFF_W_POS))
#define DSP2_MIDDLE_R_CCOEFF_W            DSP2_MIDDLE_R_CCOEFF_W
#define DSP2_MIDDLE_R_CCOEFF_W_POS        (24U)
#define DSP2_MIDDLE_R_CCOEFF_W_LEN        (8U)
#define DSP2_MIDDLE_R_CCOEFF_W_MSK        (((1U << DSP2_MIDDLE_R_CCOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_CCOEFF_W_POS)
#define DSP2_MIDDLE_R_CCOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_R_CCOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_CCOEFF_W_POS))

/* 0x234 : LSC_coeff_R_G */
#define DSP2_MIDDLE_LSC_COEFF_R_G_OFFSET (0x234)
#define DSP2_MIDDLE_R_GCOEFF_W           DSP2_MIDDLE_R_GCOEFF_W
#define DSP2_MIDDLE_R_GCOEFF_W_POS       (0U)
#define DSP2_MIDDLE_R_GCOEFF_W_LEN       (23U)
#define DSP2_MIDDLE_R_GCOEFF_W_MSK       (((1U << DSP2_MIDDLE_R_GCOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_GCOEFF_W_POS)
#define DSP2_MIDDLE_R_GCOEFF_W_UMSK      (~(((1U << DSP2_MIDDLE_R_GCOEFF_W_LEN) - 1) << DSP2_MIDDLE_R_GCOEFF_W_POS))

/* 0x238 : LSC_coeff_G_A */
#define DSP2_MIDDLE_LSC_COEFF_G_A_OFFSET (0x238)
#define DSP2_MIDDLE_G_ACOEFF_W           DSP2_MIDDLE_G_ACOEFF_W
#define DSP2_MIDDLE_G_ACOEFF_W_POS       (0U)
#define DSP2_MIDDLE_G_ACOEFF_W_LEN       (23U)
#define DSP2_MIDDLE_G_ACOEFF_W_MSK       (((1U << DSP2_MIDDLE_G_ACOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_ACOEFF_W_POS)
#define DSP2_MIDDLE_G_ACOEFF_W_UMSK      (~(((1U << DSP2_MIDDLE_G_ACOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_ACOEFF_W_POS))

/* 0x23C : LSC_coeff_G_BE */
#define DSP2_MIDDLE_LSC_COEFF_G_BE_OFFSET (0x23C)
#define DSP2_MIDDLE_G_BCOEFF_W            DSP2_MIDDLE_G_BCOEFF_W
#define DSP2_MIDDLE_G_BCOEFF_W_POS        (0U)
#define DSP2_MIDDLE_G_BCOEFF_W_LEN        (13U)
#define DSP2_MIDDLE_G_BCOEFF_W_MSK        (((1U << DSP2_MIDDLE_G_BCOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_BCOEFF_W_POS)
#define DSP2_MIDDLE_G_BCOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_G_BCOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_BCOEFF_W_POS))
#define DSP2_MIDDLE_G_ECOEFF_W            DSP2_MIDDLE_G_ECOEFF_W
#define DSP2_MIDDLE_G_ECOEFF_W_POS        (16U)
#define DSP2_MIDDLE_G_ECOEFF_W_LEN        (13U)
#define DSP2_MIDDLE_G_ECOEFF_W_MSK        (((1U << DSP2_MIDDLE_G_ECOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_ECOEFF_W_POS)
#define DSP2_MIDDLE_G_ECOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_G_ECOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_ECOEFF_W_POS))

/* 0x240 : LSC_coeff_G_CD */
#define DSP2_MIDDLE_LSC_COEFF_G_CD_OFFSET (0x240)
#define DSP2_MIDDLE_G_DCOEFF_W            DSP2_MIDDLE_G_DCOEFF_W
#define DSP2_MIDDLE_G_DCOEFF_W_POS        (0U)
#define DSP2_MIDDLE_G_DCOEFF_W_LEN        (23U)
#define DSP2_MIDDLE_G_DCOEFF_W_MSK        (((1U << DSP2_MIDDLE_G_DCOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_DCOEFF_W_POS)
#define DSP2_MIDDLE_G_DCOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_G_DCOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_DCOEFF_W_POS))
#define DSP2_MIDDLE_G_CCOEFF_W            DSP2_MIDDLE_G_CCOEFF_W
#define DSP2_MIDDLE_G_CCOEFF_W_POS        (24U)
#define DSP2_MIDDLE_G_CCOEFF_W_LEN        (8U)
#define DSP2_MIDDLE_G_CCOEFF_W_MSK        (((1U << DSP2_MIDDLE_G_CCOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_CCOEFF_W_POS)
#define DSP2_MIDDLE_G_CCOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_G_CCOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_CCOEFF_W_POS))

/* 0x244 : LSC_coeff_G_G */
#define DSP2_MIDDLE_LSC_COEFF_G_G_OFFSET (0x244)
#define DSP2_MIDDLE_G_GCOEFF_W           DSP2_MIDDLE_G_GCOEFF_W
#define DSP2_MIDDLE_G_GCOEFF_W_POS       (0U)
#define DSP2_MIDDLE_G_GCOEFF_W_LEN       (23U)
#define DSP2_MIDDLE_G_GCOEFF_W_MSK       (((1U << DSP2_MIDDLE_G_GCOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_GCOEFF_W_POS)
#define DSP2_MIDDLE_G_GCOEFF_W_UMSK      (~(((1U << DSP2_MIDDLE_G_GCOEFF_W_LEN) - 1) << DSP2_MIDDLE_G_GCOEFF_W_POS))

/* 0x248 : LSC_coeff_B_A */
#define DSP2_MIDDLE_LSC_COEFF_B_A_OFFSET (0x248)
#define DSP2_MIDDLE_B_ACOEFF_W           DSP2_MIDDLE_B_ACOEFF_W
#define DSP2_MIDDLE_B_ACOEFF_W_POS       (0U)
#define DSP2_MIDDLE_B_ACOEFF_W_LEN       (23U)
#define DSP2_MIDDLE_B_ACOEFF_W_MSK       (((1U << DSP2_MIDDLE_B_ACOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_ACOEFF_W_POS)
#define DSP2_MIDDLE_B_ACOEFF_W_UMSK      (~(((1U << DSP2_MIDDLE_B_ACOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_ACOEFF_W_POS))

/* 0x24C : LSC_coeff_B_BE */
#define DSP2_MIDDLE_LSC_COEFF_B_BE_OFFSET (0x24C)
#define DSP2_MIDDLE_B_BCOEFF_W            DSP2_MIDDLE_B_BCOEFF_W
#define DSP2_MIDDLE_B_BCOEFF_W_POS        (0U)
#define DSP2_MIDDLE_B_BCOEFF_W_LEN        (13U)
#define DSP2_MIDDLE_B_BCOEFF_W_MSK        (((1U << DSP2_MIDDLE_B_BCOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_BCOEFF_W_POS)
#define DSP2_MIDDLE_B_BCOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_B_BCOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_BCOEFF_W_POS))
#define DSP2_MIDDLE_B_ECOEFF_W            DSP2_MIDDLE_B_ECOEFF_W
#define DSP2_MIDDLE_B_ECOEFF_W_POS        (16U)
#define DSP2_MIDDLE_B_ECOEFF_W_LEN        (13U)
#define DSP2_MIDDLE_B_ECOEFF_W_MSK        (((1U << DSP2_MIDDLE_B_ECOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_ECOEFF_W_POS)
#define DSP2_MIDDLE_B_ECOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_B_ECOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_ECOEFF_W_POS))

/* 0x250 : LSC_coeff_B_CD */
#define DSP2_MIDDLE_LSC_COEFF_B_CD_OFFSET (0x250)
#define DSP2_MIDDLE_B_DCOEFF_W            DSP2_MIDDLE_B_DCOEFF_W
#define DSP2_MIDDLE_B_DCOEFF_W_POS        (0U)
#define DSP2_MIDDLE_B_DCOEFF_W_LEN        (23U)
#define DSP2_MIDDLE_B_DCOEFF_W_MSK        (((1U << DSP2_MIDDLE_B_DCOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_DCOEFF_W_POS)
#define DSP2_MIDDLE_B_DCOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_B_DCOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_DCOEFF_W_POS))
#define DSP2_MIDDLE_B_CCOEFF_W            DSP2_MIDDLE_B_CCOEFF_W
#define DSP2_MIDDLE_B_CCOEFF_W_POS        (24U)
#define DSP2_MIDDLE_B_CCOEFF_W_LEN        (8U)
#define DSP2_MIDDLE_B_CCOEFF_W_MSK        (((1U << DSP2_MIDDLE_B_CCOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_CCOEFF_W_POS)
#define DSP2_MIDDLE_B_CCOEFF_W_UMSK       (~(((1U << DSP2_MIDDLE_B_CCOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_CCOEFF_W_POS))

/* 0x254 : LSC_coeff_B_G */
#define DSP2_MIDDLE_LSC_COEFF_B_G_OFFSET (0x254)
#define DSP2_MIDDLE_B_GCOEFF_W           DSP2_MIDDLE_B_GCOEFF_W
#define DSP2_MIDDLE_B_GCOEFF_W_POS       (0U)
#define DSP2_MIDDLE_B_GCOEFF_W_LEN       (23U)
#define DSP2_MIDDLE_B_GCOEFF_W_MSK       (((1U << DSP2_MIDDLE_B_GCOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_GCOEFF_W_POS)
#define DSP2_MIDDLE_B_GCOEFF_W_UMSK      (~(((1U << DSP2_MIDDLE_B_GCOEFF_W_LEN) - 1) << DSP2_MIDDLE_B_GCOEFF_W_POS))

