RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle_reg.h
/* 0x28C : awb_b_thre */
#define DSP2_MIDDLE_AWB_B_THRE_OFFSET    (0x28C)
#define DSP2_MIDDLE_AWB_B_MAX_THR_W      DSP2_MIDDLE_AWB_B_MAX_THR_W
#define DSP2_MIDDLE_AWB_B_MAX_THR_W_POS  (0U)
#define DSP2_MIDDLE_AWB_B_MAX_THR_W_LEN  (12U)
#define DSP2_MIDDLE_AWB_B_MAX_THR_W_MSK  (((1U << DSP2_MIDDLE_AWB_B_MAX_THR_W_LEN) - 1) << DSP2_MIDDLE_AWB_B_MAX_THR_W_POS)
#define DSP2_MIDDLE_AWB_B_MAX_THR_W_UMSK (~(((1U << DSP2_MIDDLE_AWB_B_MAX_THR_W_LEN) - 1) << DSP2_MIDDLE_AWB_B_MAX_THR_W_POS))
#define DSP2_MIDDLE_AWB_B_MIN_THR_W      DSP2_MIDDLE_AWB_B_MIN_THR_W
#define DSP2_MIDDLE_AWB_B_MIN_THR_W_POS  (16U)
#define DSP2_MIDDLE_AWB_B_MIN_THR_W_LEN  (12U)
#define DSP2_MIDDLE_AWB_B_MIN_THR_W_MSK  (((1U << DSP2_MIDDLE_AWB_B_MIN_THR_W_LEN) - 1) << DSP2_MIDDLE_AWB_B_MIN_THR_W_POS)
#define DSP2_MIDDLE_AWB_B_MIN_THR_W_UMSK (~(((1U << DSP2_MIDDLE_AWB_B_MIN_THR_W_LEN) - 1) << DSP2_MIDDLE_AWB_B_MIN_THR_W_POS))

/* 0x290 : awb_rgr_gain */
#define DSP2_MIDDLE_AWB_RGR_GAIN_OFFSET  (0x290)
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE      DSP2_MIDDLE_AWB_GR_GAIN_PRE
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE_POS  (0U)
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE_LEN  (16U)
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE_MSK  (((1U << DSP2_MIDDLE_AWB_GR_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_GR_GAIN_PRE_POS)
#define DSP2_MIDDLE_AWB_GR_GAIN_PRE_UMSK (~(((1U << DSP2_MIDDLE_AWB_GR_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_GR_GAIN_PRE_POS))
#define DSP2_MIDDLE_AWB_R_GAIN_PRE       DSP2_MIDDLE_AWB_R_GAIN_PRE
#define DSP2_MIDDLE_AWB_R_GAIN_PRE_POS   (16U)
#define DSP2_MIDDLE_AWB_R_GAIN_PRE_LEN   (16U)
#define DSP2_MIDDLE_AWB_R_GAIN_PRE_MSK   (((1U << DSP2_MIDDLE_AWB_R_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_R_GAIN_PRE_POS)
#define DSP2_MIDDLE_AWB_R_GAIN_PRE_UMSK  (~(((1U << DSP2_MIDDLE_AWB_R_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_R_GAIN_PRE_POS))

/* 0x294 : awb_bgb_gain */
#define DSP2_MIDDLE_AWB_BGB_GAIN_OFFSET  (0x294)
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE      DSP2_MIDDLE_AWB_GB_GAIN_PRE
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE_POS  (0U)
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE_LEN  (16U)
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE_MSK  (((1U << DSP2_MIDDLE_AWB_GB_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_GB_GAIN_PRE_POS)
#define DSP2_MIDDLE_AWB_GB_GAIN_PRE_UMSK (~(((1U << DSP2_MIDDLE_AWB_GB_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_GB_GAIN_PRE_POS))
#define DSP2_MIDDLE_AWB_B_GAIN_PRE       DSP2_MIDDLE_AWB_B_GAIN_PRE
#define DSP2_MIDDLE_AWB_B_GAIN_PRE_POS   (16U)
#define DSP2_MIDDLE_AWB_B_GAIN_PRE_LEN   (16U)
#define DSP2_MIDDLE_AWB_B_GAIN_PRE_MSK   (((1U << DSP2_MIDDLE_AWB_B_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_B_GAIN_PRE_POS)
#define DSP2_MIDDLE_AWB_B_GAIN_PRE_UMSK  (~(((1U << DSP2_MIDDLE_AWB_B_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_B_GAIN_PRE_POS))

/* 0x298 : awb_rgr_offset */
#define DSP2_MIDDLE_AWB_RGR_OFFSET_OFFSET  (0x298)
#define DSP2_MIDDLE_AWB_GR_OFFSET_PRE      DSP2_MIDDLE_AWB_GR_OFFSET_PRE
#define DSP2_MIDDLE_AWB_GR_OFFSET_PRE_POS  (0U)
#define DSP2_MIDDLE_AWB_GR_OFFSET_PRE_LEN  (12U)
#define DSP2_MIDDLE_AWB_GR_OFFSET_PRE_MSK  (((1U << DSP2_MIDDLE_AWB_GR_OFFSET_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_GR_OFFSET_PRE_POS)
#define DSP2_MIDDLE_AWB_GR_OFFSET_PRE_UMSK (~(((1U << DSP2_MIDDLE_AWB_GR_OFFSET_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_GR_OFFSET_PRE_POS))
#define DSP2_MIDDLE_AWB_R_OFFSET_PRE       DSP2_MIDDLE_AWB_R_OFFSET_PRE
#define DSP2_MIDDLE_AWB_R_OFFSET_PRE_POS   (16U)
#define DSP2_MIDDLE_AWB_R_OFFSET_PRE_LEN   (12U)
#define DSP2_MIDDLE_AWB_R_OFFSET_PRE_MSK   (((1U << DSP2_MIDDLE_AWB_R_OFFSET_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_R_OFFSET_PRE_POS)
#define DSP2_MIDDLE_AWB_R_OFFSET_PRE_UMSK  (~(((1U << DSP2_MIDDLE_AWB_R_OFFSET_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_R_OFFSET_PRE_POS))

/* 0x29C : awb_bgb_offset */
#define DSP2_MIDDLE_AWB_BGB_OFFSET_OFFSET  (0x29C)
#define DSP2_MIDDLE_AWB_GB_OFFSET_PRE      DSP2_MIDDLE_AWB_GB_OFFSET_PRE
#define DSP2_MIDDLE_AWB_GB_OFFSET_PRE_POS  (0U)
#define DSP2_MIDDLE_AWB_GB_OFFSET_PRE_LEN  (12U)
#define DSP2_MIDDLE_AWB_GB_OFFSET_PRE_MSK  (((1U << DSP2_MIDDLE_AWB_GB_OFFSET_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_GB_OFFSET_PRE_POS)
#define DSP2_MIDDLE_AWB_GB_OFFSET_PRE_UMSK (~(((1U << DSP2_MIDDLE_AWB_GB_OFFSET_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_GB_OFFSET_PRE_POS))
#define DSP2_MIDDLE_AWB_B_OFFSET_PRE       DSP2_MIDDLE_AWB_B_OFFSET_PRE
#define DSP2_MIDDLE_AWB_B_OFFSET_PRE_POS   (16U)
#define DSP2_MIDDLE_AWB_B_OFFSET_PRE_LEN   (12U)
#define DSP2_MIDDLE_AWB_B_OFFSET_PRE_MSK   (((1U << DSP2_MIDDLE_AWB_B_OFFSET_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_B_OFFSET_PRE_POS)
#define DSP2_MIDDLE_AWB_B_OFFSET_PRE_UMSK  (~(((1U << DSP2_MIDDLE_AWB_B_OFFSET_PRE_LEN) - 1) << DSP2_MIDDLE_AWB_B_OFFSET_PRE_POS))

/* 0x2A0 : cfa_int_1 */
#define DSP2_MIDDLE_CFA_INT_1_OFFSET         (0x2A0)
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W      DSP2_MIDDLE_REG_CFA_FRINGE_ON_W
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_POS  (0U)
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_LEN  (1U)
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_MSK  (((1U << DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_LEN) - 1) << DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_POS)
#define DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_UMSK (~(((1U << DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_LEN) - 1) << DSP2_MIDDLE_REG_CFA_FRINGE_ON_W_POS))

/* 0x2A8 : digital_rgr_gain */
#define DSP2_MIDDLE_DIGITAL_RGR_GAIN_OFFSET  (0x2A8)
#define DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE      DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE
#define DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE_POS  (0U)
#define DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE_LEN  (16U)
#define DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE_MSK  (((1U << DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE_POS)
#define DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE_UMSK (~(((1U << DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_DIGITAL_GR_GAIN_PRE_POS))
#define DSP2_MIDDLE_DIGITAL_R_GAIN_PRE       DSP2_MIDDLE_DIGITAL_R_GAIN_PRE
#define DSP2_MIDDLE_DIGITAL_R_GAIN_PRE_POS   (16U)
#define DSP2_MIDDLE_DIGITAL_R_GAIN_PRE_LEN   (16U)
#define DSP2_MIDDLE_DIGITAL_R_GAIN_PRE_MSK   (((1U << DSP2_MIDDLE_DIGITAL_R_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_DIGITAL_R_GAIN_PRE_POS)
#define DSP2_MIDDLE_DIGITAL_R_GAIN_PRE_UMSK  (~(((1U << DSP2_MIDDLE_DIGITAL_R_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_DIGITAL_R_GAIN_PRE_POS))

/* 0x2AC : digital_bgb_gain */
#define DSP2_MIDDLE_DIGITAL_BGB_GAIN_OFFSET  (0x2AC)
#define DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE      DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE
#define DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE_POS  (0U)
#define DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE_LEN  (16U)
#define DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE_MSK  (((1U << DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE_POS)
#define DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE_UMSK (~(((1U << DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_DIGITAL_GB_GAIN_PRE_POS))
#define DSP2_MIDDLE_DIGITAL_B_GAIN_PRE       DSP2_MIDDLE_DIGITAL_B_GAIN_PRE
#define DSP2_MIDDLE_DIGITAL_B_GAIN_PRE_POS   (16U)
#define DSP2_MIDDLE_DIGITAL_B_GAIN_PRE_LEN   (16U)
#define DSP2_MIDDLE_DIGITAL_B_GAIN_PRE_MSK   (((1U << DSP2_MIDDLE_DIGITAL_B_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_DIGITAL_B_GAIN_PRE_POS)
#define DSP2_MIDDLE_DIGITAL_B_GAIN_PRE_UMSK  (~(((1U << DSP2_MIDDLE_DIGITAL_B_GAIN_PRE_LEN) - 1) << DSP2_MIDDLE_DIGITAL_B_GAIN_PRE_POS))

/* 0x2BC : ae_roi_x */
#define DSP2_MIDDLE_AE_ROI_X_OFFSET         (0x2BC)
#define DSP2_MIDDLE_AE_ROI_START_X_PRE      DSP2_MIDDLE_AE_ROI_START_X_PRE
#define DSP2_MIDDLE_AE_ROI_START_X_PRE_POS  (0U)
#define DSP2_MIDDLE_AE_ROI_START_X_PRE_LEN  (11U)
#define DSP2_MIDDLE_AE_ROI_START_X_PRE_MSK  (((1U << DSP2_MIDDLE_AE_ROI_START_X_PRE_LEN) - 1) << DSP2_MIDDLE_AE_ROI_START_X_PRE_POS)
#define DSP2_MIDDLE_AE_ROI_START_X_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_ROI_START_X_PRE_LEN) - 1) << DSP2_MIDDLE_AE_ROI_START_X_PRE_POS))
#define DSP2_MIDDLE_AE_ROI_WIDTH_PRE        DSP2_MIDDLE_AE_ROI_WIDTH_PRE
#define DSP2_MIDDLE_AE_ROI_WIDTH_PRE_POS    (16U)
#define DSP2_MIDDLE_AE_ROI_WIDTH_PRE_LEN    (11U)
#define DSP2_MIDDLE_AE_ROI_WIDTH_PRE_MSK    (((1U << DSP2_MIDDLE_AE_ROI_WIDTH_PRE_LEN) - 1) << DSP2_MIDDLE_AE_ROI_WIDTH_PRE_POS)
#define DSP2_MIDDLE_AE_ROI_WIDTH_PRE_UMSK   (~(((1U << DSP2_MIDDLE_AE_ROI_WIDTH_PRE_LEN) - 1) << DSP2_MIDDLE_AE_ROI_WIDTH_PRE_POS))

