RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle_reg.h
/* 0x2C0 : ae_roi_y */
#define DSP2_MIDDLE_AE_ROI_Y_OFFSET         (0x2C0)
#define DSP2_MIDDLE_AE_ROI_START_Y_PRE      DSP2_MIDDLE_AE_ROI_START_Y_PRE
#define DSP2_MIDDLE_AE_ROI_START_Y_PRE_POS  (0U)
#define DSP2_MIDDLE_AE_ROI_START_Y_PRE_LEN  (11U)
#define DSP2_MIDDLE_AE_ROI_START_Y_PRE_MSK  (((1U << DSP2_MIDDLE_AE_ROI_START_Y_PRE_LEN) - 1) << DSP2_MIDDLE_AE_ROI_START_Y_PRE_POS)
#define DSP2_MIDDLE_AE_ROI_START_Y_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_ROI_START_Y_PRE_LEN) - 1) << DSP2_MIDDLE_AE_ROI_START_Y_PRE_POS))
#define DSP2_MIDDLE_AE_ROI_HEIGHT_PRE       DSP2_MIDDLE_AE_ROI_HEIGHT_PRE
#define DSP2_MIDDLE_AE_ROI_HEIGHT_PRE_POS   (16U)
#define DSP2_MIDDLE_AE_ROI_HEIGHT_PRE_LEN   (11U)
#define DSP2_MIDDLE_AE_ROI_HEIGHT_PRE_MSK   (((1U << DSP2_MIDDLE_AE_ROI_HEIGHT_PRE_LEN) - 1) << DSP2_MIDDLE_AE_ROI_HEIGHT_PRE_POS)
#define DSP2_MIDDLE_AE_ROI_HEIGHT_PRE_UMSK  (~(((1U << DSP2_MIDDLE_AE_ROI_HEIGHT_PRE_LEN) - 1) << DSP2_MIDDLE_AE_ROI_HEIGHT_PRE_POS))

/* 0x2C4 : ae_image_size */
#define DSP2_MIDDLE_AE_IMAGE_SIZE_OFFSET     (0x2C4)
#define DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE       DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE
#define DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE_POS   (0U)
#define DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE_LEN   (11U)
#define DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE_MSK   (((1U << DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE_LEN) - 1) << DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE_POS)
#define DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE_UMSK  (~(((1U << DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE_LEN) - 1) << DSP2_MIDDLE_AE_IMAGE_WIDTH_PRE_POS))
#define DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE      DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE
#define DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE_POS  (16U)
#define DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE_LEN  (11U)
#define DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE_MSK  (((1U << DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE_LEN) - 1) << DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE_POS)
#define DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE_LEN) - 1) << DSP2_MIDDLE_AE_IMAGE_HEIGHT_PRE_POS))

/* 0x2C8 : ae_grid_size */
#define DSP2_MIDDLE_AE_GRID_SIZE_OFFSET        (0x2C8)
#define DSP2_MIDDLE_AE_GRID_WIDTH_PRE          DSP2_MIDDLE_AE_GRID_WIDTH_PRE
#define DSP2_MIDDLE_AE_GRID_WIDTH_PRE_POS      (0U)
#define DSP2_MIDDLE_AE_GRID_WIDTH_PRE_LEN      (8U)
#define DSP2_MIDDLE_AE_GRID_WIDTH_PRE_MSK      (((1U << DSP2_MIDDLE_AE_GRID_WIDTH_PRE_LEN) - 1) << DSP2_MIDDLE_AE_GRID_WIDTH_PRE_POS)
#define DSP2_MIDDLE_AE_GRID_WIDTH_PRE_UMSK     (~(((1U << DSP2_MIDDLE_AE_GRID_WIDTH_PRE_LEN) - 1) << DSP2_MIDDLE_AE_GRID_WIDTH_PRE_POS))
#define DSP2_MIDDLE_AE_GRID_HEIGHT_PRE         DSP2_MIDDLE_AE_GRID_HEIGHT_PRE
#define DSP2_MIDDLE_AE_GRID_HEIGHT_PRE_POS     (8U)
#define DSP2_MIDDLE_AE_GRID_HEIGHT_PRE_LEN     (8U)
#define DSP2_MIDDLE_AE_GRID_HEIGHT_PRE_MSK     (((1U << DSP2_MIDDLE_AE_GRID_HEIGHT_PRE_LEN) - 1) << DSP2_MIDDLE_AE_GRID_HEIGHT_PRE_POS)
#define DSP2_MIDDLE_AE_GRID_HEIGHT_PRE_UMSK    (~(((1U << DSP2_MIDDLE_AE_GRID_HEIGHT_PRE_LEN) - 1) << DSP2_MIDDLE_AE_GRID_HEIGHT_PRE_POS))
#define DSP2_MIDDLE_AE_GRID_Y_MAX_PRE          DSP2_MIDDLE_AE_GRID_Y_MAX_PRE
#define DSP2_MIDDLE_AE_GRID_Y_MAX_PRE_POS      (16U)
#define DSP2_MIDDLE_AE_GRID_Y_MAX_PRE_LEN      (4U)
#define DSP2_MIDDLE_AE_GRID_Y_MAX_PRE_MSK      (((1U << DSP2_MIDDLE_AE_GRID_Y_MAX_PRE_LEN) - 1) << DSP2_MIDDLE_AE_GRID_Y_MAX_PRE_POS)
#define DSP2_MIDDLE_AE_GRID_Y_MAX_PRE_UMSK     (~(((1U << DSP2_MIDDLE_AE_GRID_Y_MAX_PRE_LEN) - 1) << DSP2_MIDDLE_AE_GRID_Y_MAX_PRE_POS))
#define DSP2_MIDDLE_AE_GRID_X_MAX_PRE          DSP2_MIDDLE_AE_GRID_X_MAX_PRE
#define DSP2_MIDDLE_AE_GRID_X_MAX_PRE_POS      (20U)
#define DSP2_MIDDLE_AE_GRID_X_MAX_PRE_LEN      (4U)
#define DSP2_MIDDLE_AE_GRID_X_MAX_PRE_MSK      (((1U << DSP2_MIDDLE_AE_GRID_X_MAX_PRE_LEN) - 1) << DSP2_MIDDLE_AE_GRID_X_MAX_PRE_POS)
#define DSP2_MIDDLE_AE_GRID_X_MAX_PRE_UMSK     (~(((1U << DSP2_MIDDLE_AE_GRID_X_MAX_PRE_LEN) - 1) << DSP2_MIDDLE_AE_GRID_X_MAX_PRE_POS))
#define DSP2_MIDDLE_NEW_AE_STA_ENABLE_W        DSP2_MIDDLE_NEW_AE_STA_ENABLE_W
#define DSP2_MIDDLE_NEW_AE_STA_ENABLE_W_POS    (24U)
#define DSP2_MIDDLE_NEW_AE_STA_ENABLE_W_LEN    (1U)
#define DSP2_MIDDLE_NEW_AE_STA_ENABLE_W_MSK    (((1U << DSP2_MIDDLE_NEW_AE_STA_ENABLE_W_LEN) - 1) << DSP2_MIDDLE_NEW_AE_STA_ENABLE_W_POS)
#define DSP2_MIDDLE_NEW_AE_STA_ENABLE_W_UMSK   (~(((1U << DSP2_MIDDLE_NEW_AE_STA_ENABLE_W_LEN) - 1) << DSP2_MIDDLE_NEW_AE_STA_ENABLE_W_POS))
#define DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE      DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE
#define DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE_POS  (25U)
#define DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE_LEN  (1U)
#define DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE_MSK  (((1U << DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE_POS)
#define DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_SWITCH_BANK_EN_PRE_POS))
#define DSP2_MIDDLE_AE_HIST_EN_PRE             DSP2_MIDDLE_AE_HIST_EN_PRE
#define DSP2_MIDDLE_AE_HIST_EN_PRE_POS         (26U)
#define DSP2_MIDDLE_AE_HIST_EN_PRE_LEN         (1U)
#define DSP2_MIDDLE_AE_HIST_EN_PRE_MSK         (((1U << DSP2_MIDDLE_AE_HIST_EN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_EN_PRE_POS)
#define DSP2_MIDDLE_AE_HIST_EN_PRE_UMSK        (~(((1U << DSP2_MIDDLE_AE_HIST_EN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_EN_PRE_POS))
#define DSP2_MIDDLE_AE_HIST_MODE_PRE           DSP2_MIDDLE_AE_HIST_MODE_PRE
#define DSP2_MIDDLE_AE_HIST_MODE_PRE_POS       (27U)
#define DSP2_MIDDLE_AE_HIST_MODE_PRE_LEN       (1U)
#define DSP2_MIDDLE_AE_HIST_MODE_PRE_MSK       (((1U << DSP2_MIDDLE_AE_HIST_MODE_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_MODE_PRE_POS)
#define DSP2_MIDDLE_AE_HIST_MODE_PRE_UMSK      (~(((1U << DSP2_MIDDLE_AE_HIST_MODE_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_MODE_PRE_POS))
#define DSP2_MIDDLE_AE_HIST_ROI_EN_PRE         DSP2_MIDDLE_AE_HIST_ROI_EN_PRE
#define DSP2_MIDDLE_AE_HIST_ROI_EN_PRE_POS     (28U)
#define DSP2_MIDDLE_AE_HIST_ROI_EN_PRE_LEN     (1U)
#define DSP2_MIDDLE_AE_HIST_ROI_EN_PRE_MSK     (((1U << DSP2_MIDDLE_AE_HIST_ROI_EN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_ROI_EN_PRE_POS)
#define DSP2_MIDDLE_AE_HIST_ROI_EN_PRE_UMSK    (~(((1U << DSP2_MIDDLE_AE_HIST_ROI_EN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_ROI_EN_PRE_POS))

/* 0x2CC : ae_coeff */
#define DSP2_MIDDLE_AE_COEFF_OFFSET          (0x2CC)
#define DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE      DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE
#define DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE_POS  (0U)
#define DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE_LEN  (8U)
#define DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE_MSK  (((1U << DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE_LEN) - 1) << DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE_POS)
#define DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE_LEN) - 1) << DSP2_MIDDLE_AE_YSUM_COEFF_R_PRE_POS))
#define DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE      DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE
#define DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE_POS  (8U)
#define DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE_LEN  (8U)
#define DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE_MSK  (((1U << DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE_LEN) - 1) << DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE_POS)
#define DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE_LEN) - 1) << DSP2_MIDDLE_AE_YSUM_COEFF_G_PRE_POS))
#define DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE      DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE
#define DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE_POS  (16U)
#define DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE_LEN  (8U)
#define DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE_MSK  (((1U << DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE_LEN) - 1) << DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE_POS)
#define DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE_LEN) - 1) << DSP2_MIDDLE_AE_YSUM_COEFF_B_PRE_POS))

/* 0x2D0 : ae2_roi_x */
#define DSP2_MIDDLE_AE2_ROI_X_OFFSET       (0x2D0)
#define DSP2_MIDDLE_AE_HIST_X_MAX_PRE      DSP2_MIDDLE_AE_HIST_X_MAX_PRE
#define DSP2_MIDDLE_AE_HIST_X_MAX_PRE_POS  (0U)
#define DSP2_MIDDLE_AE_HIST_X_MAX_PRE_LEN  (11U)
#define DSP2_MIDDLE_AE_HIST_X_MAX_PRE_MSK  (((1U << DSP2_MIDDLE_AE_HIST_X_MAX_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_X_MAX_PRE_POS)
#define DSP2_MIDDLE_AE_HIST_X_MAX_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_HIST_X_MAX_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_X_MAX_PRE_POS))
#define DSP2_MIDDLE_AE_HIST_X_MIN_PRE      DSP2_MIDDLE_AE_HIST_X_MIN_PRE
#define DSP2_MIDDLE_AE_HIST_X_MIN_PRE_POS  (16U)
#define DSP2_MIDDLE_AE_HIST_X_MIN_PRE_LEN  (11U)
#define DSP2_MIDDLE_AE_HIST_X_MIN_PRE_MSK  (((1U << DSP2_MIDDLE_AE_HIST_X_MIN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_X_MIN_PRE_POS)
#define DSP2_MIDDLE_AE_HIST_X_MIN_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_HIST_X_MIN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_X_MIN_PRE_POS))

/* 0x2D4 : ae2_roi_y */
#define DSP2_MIDDLE_AE2_ROI_Y_OFFSET       (0x2D4)
#define DSP2_MIDDLE_AE_HIST_Y_MAX_PRE      DSP2_MIDDLE_AE_HIST_Y_MAX_PRE
#define DSP2_MIDDLE_AE_HIST_Y_MAX_PRE_POS  (0U)
#define DSP2_MIDDLE_AE_HIST_Y_MAX_PRE_LEN  (11U)
#define DSP2_MIDDLE_AE_HIST_Y_MAX_PRE_MSK  (((1U << DSP2_MIDDLE_AE_HIST_Y_MAX_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_Y_MAX_PRE_POS)
#define DSP2_MIDDLE_AE_HIST_Y_MAX_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_HIST_Y_MAX_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_Y_MAX_PRE_POS))
#define DSP2_MIDDLE_AE_HIST_Y_MIN_PRE      DSP2_MIDDLE_AE_HIST_Y_MIN_PRE
#define DSP2_MIDDLE_AE_HIST_Y_MIN_PRE_POS  (16U)
#define DSP2_MIDDLE_AE_HIST_Y_MIN_PRE_LEN  (11U)
#define DSP2_MIDDLE_AE_HIST_Y_MIN_PRE_MSK  (((1U << DSP2_MIDDLE_AE_HIST_Y_MIN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_Y_MIN_PRE_POS)
#define DSP2_MIDDLE_AE_HIST_Y_MIN_PRE_UMSK (~(((1U << DSP2_MIDDLE_AE_HIST_Y_MIN_PRE_LEN) - 1) << DSP2_MIDDLE_AE_HIST_Y_MIN_PRE_POS))

/* 0x2E8 : ae_status */
#define DSP2_MIDDLE_AE_STATUS_OFFSET     (0x2E8)
#define DSP2_MIDDLE_AE_HIST_W_CNT_R      DSP2_MIDDLE_AE_HIST_W_CNT_R
#define DSP2_MIDDLE_AE_HIST_W_CNT_R_POS  (4U)
#define DSP2_MIDDLE_AE_HIST_W_CNT_R_LEN  (5U)
#define DSP2_MIDDLE_AE_HIST_W_CNT_R_MSK  (((1U << DSP2_MIDDLE_AE_HIST_W_CNT_R_LEN) - 1) << DSP2_MIDDLE_AE_HIST_W_CNT_R_POS)
#define DSP2_MIDDLE_AE_HIST_W_CNT_R_UMSK (~(((1U << DSP2_MIDDLE_AE_HIST_W_CNT_R_LEN) - 1) << DSP2_MIDDLE_AE_HIST_W_CNT_R_POS))
#define DSP2_MIDDLE_BLAE_BUF_IDX_R       DSP2_MIDDLE_BLAE_BUF_IDX_R
#define DSP2_MIDDLE_BLAE_BUF_IDX_R_POS   (16U)
#define DSP2_MIDDLE_BLAE_BUF_IDX_R_LEN   (1U)
#define DSP2_MIDDLE_BLAE_BUF_IDX_R_MSK   (((1U << DSP2_MIDDLE_BLAE_BUF_IDX_R_LEN) - 1) << DSP2_MIDDLE_BLAE_BUF_IDX_R_POS)
#define DSP2_MIDDLE_BLAE_BUF_IDX_R_UMSK  (~(((1U << DSP2_MIDDLE_BLAE_BUF_IDX_R_LEN) - 1) << DSP2_MIDDLE_BLAE_BUF_IDX_R_POS))
#define DSP2_MIDDLE_BLAE_W_CNT_R         DSP2_MIDDLE_BLAE_W_CNT_R
#define DSP2_MIDDLE_BLAE_W_CNT_R_POS     (20U)
#define DSP2_MIDDLE_BLAE_W_CNT_R_LEN     (5U)
#define DSP2_MIDDLE_BLAE_W_CNT_R_MSK     (((1U << DSP2_MIDDLE_BLAE_W_CNT_R_LEN) - 1) << DSP2_MIDDLE_BLAE_W_CNT_R_POS)
#define DSP2_MIDDLE_BLAE_W_CNT_R_UMSK    (~(((1U << DSP2_MIDDLE_BLAE_W_CNT_R_LEN) - 1) << DSP2_MIDDLE_BLAE_W_CNT_R_POS))

/* 0x2EC : ae_sta_dbg */
#define DSP2_MIDDLE_AE_STA_DBG_OFFSET      (0x2EC)
#define DSP2_MIDDLE_AE_GRID_CNT            DSP2_MIDDLE_AE_GRID_CNT
#define DSP2_MIDDLE_AE_GRID_CNT_POS        (0U)
#define DSP2_MIDDLE_AE_GRID_CNT_LEN        (7U)
#define DSP2_MIDDLE_AE_GRID_CNT_MSK        (((1U << DSP2_MIDDLE_AE_GRID_CNT_LEN) - 1) << DSP2_MIDDLE_AE_GRID_CNT_POS)
#define DSP2_MIDDLE_AE_GRID_CNT_UMSK       (~(((1U << DSP2_MIDDLE_AE_GRID_CNT_LEN) - 1) << DSP2_MIDDLE_AE_GRID_CNT_POS))
#define DSP2_MIDDLE_AE_STA_DONE            DSP2_MIDDLE_AE_STA_DONE
#define DSP2_MIDDLE_AE_STA_DONE_POS        (7U)
#define DSP2_MIDDLE_AE_STA_DONE_LEN        (1U)
#define DSP2_MIDDLE_AE_STA_DONE_MSK        (((1U << DSP2_MIDDLE_AE_STA_DONE_LEN) - 1) << DSP2_MIDDLE_AE_STA_DONE_POS)
#define DSP2_MIDDLE_AE_STA_DONE_UMSK       (~(((1U << DSP2_MIDDLE_AE_STA_DONE_LEN) - 1) << DSP2_MIDDLE_AE_STA_DONE_POS))
#define DSP2_MIDDLE_AE_WRITE_DATA_CNT      DSP2_MIDDLE_AE_WRITE_DATA_CNT
#define DSP2_MIDDLE_AE_WRITE_DATA_CNT_POS  (8U)
#define DSP2_MIDDLE_AE_WRITE_DATA_CNT_LEN  (8U)
#define DSP2_MIDDLE_AE_WRITE_DATA_CNT_MSK  (((1U << DSP2_MIDDLE_AE_WRITE_DATA_CNT_LEN) - 1) << DSP2_MIDDLE_AE_WRITE_DATA_CNT_POS)
#define DSP2_MIDDLE_AE_WRITE_DATA_CNT_UMSK (~(((1U << DSP2_MIDDLE_AE_WRITE_DATA_CNT_LEN) - 1) << DSP2_MIDDLE_AE_WRITE_DATA_CNT_POS))
#define DSP2_MIDDLE_AE_STA_INT_FLAG        DSP2_MIDDLE_AE_STA_INT_FLAG
#define DSP2_MIDDLE_AE_STA_INT_FLAG_POS    (16U)
#define DSP2_MIDDLE_AE_STA_INT_FLAG_LEN    (1U)
#define DSP2_MIDDLE_AE_STA_INT_FLAG_MSK    (((1U << DSP2_MIDDLE_AE_STA_INT_FLAG_LEN) - 1) << DSP2_MIDDLE_AE_STA_INT_FLAG_POS)
#define DSP2_MIDDLE_AE_STA_INT_FLAG_UMSK   (~(((1U << DSP2_MIDDLE_AE_STA_INT_FLAG_LEN) - 1) << DSP2_MIDDLE_AE_STA_INT_FLAG_POS))
#define DSP2_MIDDLE_AE_GRID_CNT_MAX        DSP2_MIDDLE_AE_GRID_CNT_MAX
#define DSP2_MIDDLE_AE_GRID_CNT_MAX_POS    (17U)
#define DSP2_MIDDLE_AE_GRID_CNT_MAX_LEN    (7U)
#define DSP2_MIDDLE_AE_GRID_CNT_MAX_MSK    (((1U << DSP2_MIDDLE_AE_GRID_CNT_MAX_LEN) - 1) << DSP2_MIDDLE_AE_GRID_CNT_MAX_POS)
#define DSP2_MIDDLE_AE_GRID_CNT_MAX_UMSK   (~(((1U << DSP2_MIDDLE_AE_GRID_CNT_MAX_LEN) - 1) << DSP2_MIDDLE_AE_GRID_CNT_MAX_POS))
#define DSP2_MIDDLE_AE_FIFO_FULL           DSP2_MIDDLE_AE_FIFO_FULL
#define DSP2_MIDDLE_AE_FIFO_FULL_POS       (24U)
#define DSP2_MIDDLE_AE_FIFO_FULL_LEN       (1U)
#define DSP2_MIDDLE_AE_FIFO_FULL_MSK       (((1U << DSP2_MIDDLE_AE_FIFO_FULL_LEN) - 1) << DSP2_MIDDLE_AE_FIFO_FULL_POS)
#define DSP2_MIDDLE_AE_FIFO_FULL_UMSK      (~(((1U << DSP2_MIDDLE_AE_FIFO_FULL_LEN) - 1) << DSP2_MIDDLE_AE_FIFO_FULL_POS))
#define DSP2_MIDDLE_AE_CONTROL_STATUS      DSP2_MIDDLE_AE_CONTROL_STATUS
#define DSP2_MIDDLE_AE_CONTROL_STATUS_POS  (25U)
#define DSP2_MIDDLE_AE_CONTROL_STATUS_LEN  (4U)
#define DSP2_MIDDLE_AE_CONTROL_STATUS_MSK  (((1U << DSP2_MIDDLE_AE_CONTROL_STATUS_LEN) - 1) << DSP2_MIDDLE_AE_CONTROL_STATUS_POS)
#define DSP2_MIDDLE_AE_CONTROL_STATUS_UMSK (~(((1U << DSP2_MIDDLE_AE_CONTROL_STATUS_LEN) - 1) << DSP2_MIDDLE_AE_CONTROL_STATUS_POS))
#define DSP2_MIDDLE_AE_OPERATION_DONE      DSP2_MIDDLE_AE_OPERATION_DONE
#define DSP2_MIDDLE_AE_OPERATION_DONE_POS  (29U)
#define DSP2_MIDDLE_AE_OPERATION_DONE_LEN  (1U)
#define DSP2_MIDDLE_AE_OPERATION_DONE_MSK  (((1U << DSP2_MIDDLE_AE_OPERATION_DONE_LEN) - 1) << DSP2_MIDDLE_AE_OPERATION_DONE_POS)
#define DSP2_MIDDLE_AE_OPERATION_DONE_UMSK (~(((1U << DSP2_MIDDLE_AE_OPERATION_DONE_LEN) - 1) << DSP2_MIDDLE_AE_OPERATION_DONE_POS))
#define DSP2_MIDDLE_AE_FIFO_EMPTY          DSP2_MIDDLE_AE_FIFO_EMPTY
#define DSP2_MIDDLE_AE_FIFO_EMPTY_POS      (30U)
#define DSP2_MIDDLE_AE_FIFO_EMPTY_LEN      (1U)
#define DSP2_MIDDLE_AE_FIFO_EMPTY_MSK      (((1U << DSP2_MIDDLE_AE_FIFO_EMPTY_LEN) - 1) << DSP2_MIDDLE_AE_FIFO_EMPTY_POS)
#define DSP2_MIDDLE_AE_FIFO_EMPTY_UMSK     (~(((1U << DSP2_MIDDLE_AE_FIFO_EMPTY_LEN) - 1) << DSP2_MIDDLE_AE_FIFO_EMPTY_POS))

/* 0x2F4 : awb_sta_dbg1 */
#define DSP2_MIDDLE_AWB_STA_DBG1_OFFSET     (0x2F4)
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX        DSP2_MIDDLE_AWB_GRID_CNT_MAX
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX_POS    (0U)
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX_LEN    (11U)
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX_MSK    (((1U << DSP2_MIDDLE_AWB_GRID_CNT_MAX_LEN) - 1) << DSP2_MIDDLE_AWB_GRID_CNT_MAX_POS)
#define DSP2_MIDDLE_AWB_GRID_CNT_MAX_UMSK   (~(((1U << DSP2_MIDDLE_AWB_GRID_CNT_MAX_LEN) - 1) << DSP2_MIDDLE_AWB_GRID_CNT_MAX_POS))
#define DSP2_MIDDLE_AWB_FIFO_FULL           DSP2_MIDDLE_AWB_FIFO_FULL
#define DSP2_MIDDLE_AWB_FIFO_FULL_POS       (12U)
#define DSP2_MIDDLE_AWB_FIFO_FULL_LEN       (1U)
#define DSP2_MIDDLE_AWB_FIFO_FULL_MSK       (((1U << DSP2_MIDDLE_AWB_FIFO_FULL_LEN) - 1) << DSP2_MIDDLE_AWB_FIFO_FULL_POS)
#define DSP2_MIDDLE_AWB_FIFO_FULL_UMSK      (~(((1U << DSP2_MIDDLE_AWB_FIFO_FULL_LEN) - 1) << DSP2_MIDDLE_AWB_FIFO_FULL_POS))
#define DSP2_MIDDLE_AWB_CONTROL_STATUS      DSP2_MIDDLE_AWB_CONTROL_STATUS
#define DSP2_MIDDLE_AWB_CONTROL_STATUS_POS  (16U)
#define DSP2_MIDDLE_AWB_CONTROL_STATUS_LEN  (4U)
#define DSP2_MIDDLE_AWB_CONTROL_STATUS_MSK  (((1U << DSP2_MIDDLE_AWB_CONTROL_STATUS_LEN) - 1) << DSP2_MIDDLE_AWB_CONTROL_STATUS_POS)
#define DSP2_MIDDLE_AWB_CONTROL_STATUS_UMSK (~(((1U << DSP2_MIDDLE_AWB_CONTROL_STATUS_LEN) - 1) << DSP2_MIDDLE_AWB_CONTROL_STATUS_POS))
#define DSP2_MIDDLE_AWB_OPERATION_DONE      DSP2_MIDDLE_AWB_OPERATION_DONE
#define DSP2_MIDDLE_AWB_OPERATION_DONE_POS  (20U)
#define DSP2_MIDDLE_AWB_OPERATION_DONE_LEN  (1U)
#define DSP2_MIDDLE_AWB_OPERATION_DONE_MSK  (((1U << DSP2_MIDDLE_AWB_OPERATION_DONE_LEN) - 1) << DSP2_MIDDLE_AWB_OPERATION_DONE_POS)
#define DSP2_MIDDLE_AWB_OPERATION_DONE_UMSK (~(((1U << DSP2_MIDDLE_AWB_OPERATION_DONE_LEN) - 1) << DSP2_MIDDLE_AWB_OPERATION_DONE_POS))
#define DSP2_MIDDLE_AWB_FIFO_EMPTY          DSP2_MIDDLE_AWB_FIFO_EMPTY
#define DSP2_MIDDLE_AWB_FIFO_EMPTY_POS      (21U)
#define DSP2_MIDDLE_AWB_FIFO_EMPTY_LEN      (1U)
#define DSP2_MIDDLE_AWB_FIFO_EMPTY_MSK      (((1U << DSP2_MIDDLE_AWB_FIFO_EMPTY_LEN) - 1) << DSP2_MIDDLE_AWB_FIFO_EMPTY_POS)
#define DSP2_MIDDLE_AWB_FIFO_EMPTY_UMSK     (~(((1U << DSP2_MIDDLE_AWB_FIFO_EMPTY_LEN) - 1) << DSP2_MIDDLE_AWB_FIFO_EMPTY_POS))
#define DSP2_MIDDLE_BLAWB_W_CNT_R           DSP2_MIDDLE_BLAWB_W_CNT_R
#define DSP2_MIDDLE_BLAWB_W_CNT_R_POS       (24U)
#define DSP2_MIDDLE_BLAWB_W_CNT_R_LEN       (5U)
#define DSP2_MIDDLE_BLAWB_W_CNT_R_MSK       (((1U << DSP2_MIDDLE_BLAWB_W_CNT_R_LEN) - 1) << DSP2_MIDDLE_BLAWB_W_CNT_R_POS)
#define DSP2_MIDDLE_BLAWB_W_CNT_R_UMSK      (~(((1U << DSP2_MIDDLE_BLAWB_W_CNT_R_LEN) - 1) << DSP2_MIDDLE_BLAWB_W_CNT_R_POS))
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R         DSP2_MIDDLE_BLAWB_BUF_IDX_R
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R_POS     (31U)
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R_LEN     (1U)
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R_MSK     (((1U << DSP2_MIDDLE_BLAWB_BUF_IDX_R_LEN) - 1) << DSP2_MIDDLE_BLAWB_BUF_IDX_R_POS)
#define DSP2_MIDDLE_BLAWB_BUF_IDX_R_UMSK    (~(((1U << DSP2_MIDDLE_BLAWB_BUF_IDX_R_LEN) - 1) << DSP2_MIDDLE_BLAWB_BUF_IDX_R_POS))

/* 0x2F8 : awb_sta_dbg0 */
#define DSP2_MIDDLE_AWB_STA_DBG0_OFFSET     (0x2F8)
#define DSP2_MIDDLE_AWB_GRID_CNT            DSP2_MIDDLE_AWB_GRID_CNT
#define DSP2_MIDDLE_AWB_GRID_CNT_POS        (0U)
#define DSP2_MIDDLE_AWB_GRID_CNT_LEN        (10U)
#define DSP2_MIDDLE_AWB_GRID_CNT_MSK        (((1U << DSP2_MIDDLE_AWB_GRID_CNT_LEN) - 1) << DSP2_MIDDLE_AWB_GRID_CNT_POS)
#define DSP2_MIDDLE_AWB_GRID_CNT_UMSK       (~(((1U << DSP2_MIDDLE_AWB_GRID_CNT_LEN) - 1) << DSP2_MIDDLE_AWB_GRID_CNT_POS))
#define DSP2_MIDDLE_AWB_STA_DONE            DSP2_MIDDLE_AWB_STA_DONE
#define DSP2_MIDDLE_AWB_STA_DONE_POS        (12U)
#define DSP2_MIDDLE_AWB_STA_DONE_LEN        (1U)
#define DSP2_MIDDLE_AWB_STA_DONE_MSK        (((1U << DSP2_MIDDLE_AWB_STA_DONE_LEN) - 1) << DSP2_MIDDLE_AWB_STA_DONE_POS)
#define DSP2_MIDDLE_AWB_STA_DONE_UMSK       (~(((1U << DSP2_MIDDLE_AWB_STA_DONE_LEN) - 1) << DSP2_MIDDLE_AWB_STA_DONE_POS))
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT      DSP2_MIDDLE_AWB_WRITE_DATA_CNT
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT_POS  (16U)
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT_LEN  (12U)
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT_MSK  (((1U << DSP2_MIDDLE_AWB_WRITE_DATA_CNT_LEN) - 1) << DSP2_MIDDLE_AWB_WRITE_DATA_CNT_POS)
#define DSP2_MIDDLE_AWB_WRITE_DATA_CNT_UMSK (~(((1U << DSP2_MIDDLE_AWB_WRITE_DATA_CNT_LEN) - 1) << DSP2_MIDDLE_AWB_WRITE_DATA_CNT_POS))
#define DSP2_MIDDLE_AWB_STA_INT_FLAG        DSP2_MIDDLE_AWB_STA_INT_FLAG
#define DSP2_MIDDLE_AWB_STA_INT_FLAG_POS    (28U)
#define DSP2_MIDDLE_AWB_STA_INT_FLAG_LEN    (1U)
#define DSP2_MIDDLE_AWB_STA_INT_FLAG_MSK    (((1U << DSP2_MIDDLE_AWB_STA_INT_FLAG_LEN) - 1) << DSP2_MIDDLE_AWB_STA_INT_FLAG_POS)
#define DSP2_MIDDLE_AWB_STA_INT_FLAG_UMSK   (~(((1U << DSP2_MIDDLE_AWB_STA_INT_FLAG_LEN) - 1) << DSP2_MIDDLE_AWB_STA_INT_FLAG_POS))

