RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle_reg.h
/* 0x2FC : dummy */
#define DSP2_MIDDLE_DUMMY_OFFSET (0x2FC)

struct dsp2_middle_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[548];

    /* 0x224 : LSC_setting */
    union {
        struct {
            uint32_t reserved_0_7  : 8; /* [ 7: 0],       rsvd,        0x0 */
            uint32_t Lsc_on_w      : 1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_15 : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t X_offset_w    : 8; /* [23:16],        r/w,        0x4 */
            uint32_t Y_offset_w    : 8; /* [31:24],        r/w,        0x4 */
        } BF;
        uint32_t WORD;
    } LSC_setting;

    /* 0x228 : LSC_coeff_R_A */
    union {
        struct {
            uint32_t R_Acoeff_w     : 23; /* [22: 0],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LSC_coeff_R_A;

    /* 0x22C : LSC_coeff_R_BE */
    union {
        struct {
            uint32_t R_Bcoeff_w     : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t R_Ecoeff_w     : 13; /* [28:16],        r/w,        0x0 */
            uint32_t reserved_29_31 : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LSC_coeff_R_BE;

    /* 0x230 : LSC_coeff_R_CD */
    union {
        struct {
            uint32_t R_Dcoeff_w  : 23; /* [22: 0],        r/w,        0x0 */
            uint32_t reserved_23 : 1;  /* [   23],       rsvd,        0x0 */
            uint32_t R_Ccoeff_w  : 8;  /* [31:24],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } LSC_coeff_R_CD;

    /* 0x234 : LSC_coeff_R_G */
    union {
        struct {
            uint32_t R_Gcoeff_w     : 23; /* [22: 0],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LSC_coeff_R_G;

    /* 0x238 : LSC_coeff_G_A */
    union {
        struct {
            uint32_t G_Acoeff_w     : 23; /* [22: 0],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LSC_coeff_G_A;

    /* 0x23C : LSC_coeff_G_BE */
    union {
        struct {
            uint32_t G_Bcoeff_w     : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t G_Ecoeff_w     : 13; /* [28:16],        r/w,        0x0 */
            uint32_t reserved_29_31 : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LSC_coeff_G_BE;

    /* 0x240 : LSC_coeff_G_CD */
    union {
        struct {
            uint32_t G_Dcoeff_w  : 23; /* [22: 0],        r/w,        0x0 */
            uint32_t reserved_23 : 1;  /* [   23],       rsvd,        0x0 */
            uint32_t G_Ccoeff_w  : 8;  /* [31:24],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } LSC_coeff_G_CD;

    /* 0x244 : LSC_coeff_G_G */
    union {
        struct {
            uint32_t G_Gcoeff_w     : 23; /* [22: 0],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LSC_coeff_G_G;

    /* 0x248 : LSC_coeff_B_A */
    union {
        struct {
            uint32_t B_Acoeff_w     : 23; /* [22: 0],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LSC_coeff_B_A;

    /* 0x24C : LSC_coeff_B_BE */
    union {
        struct {
            uint32_t B_Bcoeff_w     : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t B_Ecoeff_w     : 13; /* [28:16],        r/w,        0x0 */
            uint32_t reserved_29_31 : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LSC_coeff_B_BE;

    /* 0x250 : LSC_coeff_B_CD */
    union {
        struct {
            uint32_t B_Dcoeff_w  : 23; /* [22: 0],        r/w,        0x0 */
            uint32_t reserved_23 : 1;  /* [   23],       rsvd,        0x0 */
            uint32_t B_Ccoeff_w  : 8;  /* [31:24],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } LSC_coeff_B_CD;

    /* 0x254 : LSC_coeff_B_G */
    union {
        struct {
            uint32_t B_Gcoeff_w     : 23; /* [22: 0],        r/w,        0x0 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } LSC_coeff_B_G;

    /* 0x258 : MAX_R_G */
    union {
        struct {
            uint32_t MAXR_w : 16; /* [15: 0],        r/w,       0xff */
            uint32_t MAXG_w : 16; /* [31:16],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } MAX_R_G;

    /* 0x25C : MAX_B */
    union {
        struct {
            uint32_t MAXB_w         : 16; /* [15: 0],        r/w,       0xff */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } MAX_B;

    /* 0x260 : defect_setting */
    union {
        struct {
            uint32_t defect_correct_mode_w : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t reserved_3_7          : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t resolution_enhance1_w : 1; /* [    8],        r/w,        0x1 */
            uint32_t resolution_enhance2_w : 1; /* [    9],        r/w,        0x1 */
            uint32_t resolution_enhance3_w : 1; /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_15        : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t defect_address_w      : 8; /* [23:16],        r/w,        0x4 */
            uint32_t reserved_24_31        : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } defect_setting;

