RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle_reg.h
    /* 0x264 : defect_position */
    union {
        struct {
            uint32_t x_position_w : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t y_position_w : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } defect_position;

    /* 0x268 : defect_th_A */
    union {
        struct {
            uint32_t defect_th1_w : 8; /* [ 7: 0],        r/w,       0x46 */
            uint32_t defect_th2_w : 8; /* [15: 8],        r/w,       0x14 */
            uint32_t defect_th3_w : 8; /* [23:16],        r/w,       0x32 */
            uint32_t defect_th4_w : 8; /* [31:24],        r/w,       0x32 */
        } BF;
        uint32_t WORD;
    } defect_th_A;

    /* 0x26C : defect_th_B */
    union {
        struct {
            uint32_t defect_th5_w  : 8;  /* [ 7: 0],        r/w,       0x14 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } defect_th_B;

    /* 0x270 : awb_setting */
    union {
        struct {
            uint32_t awb_switch_bank_en_w   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t new_awb_sta_enable_w   : 1;  /* [    1],        r/w,        0x0 */
            uint32_t bl_awb_gain_sel_w      : 1;  /* [    2],        r/w,        0x1 */
            uint32_t bl_digital_gain_sel_w  : 1;  /* [    3],        r/w,        0x1 */
            uint32_t reserved_4_15          : 12; /* [15: 4],       rsvd,        0x0 */
            uint32_t grid_cnt_within_thre_r : 11; /* [26:16],          r,        0x0 */
            uint32_t reserved_27_31         : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_setting;

    /* 0x274 : awb_roi_x */
    union {
        struct {
            uint32_t awb_roi_start_x_w : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t awb_roi_width_w   : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_roi_x;

    /* 0x278 : awb_roi_y */
    union {
        struct {
            uint32_t awb_roi_start_y_w : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t awb_roi_height_w  : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_roi_y;

    /* 0x27C : awb_image_size */
    union {
        struct {
            uint32_t awb_image_width_w  : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15     : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t awb_image_height_w : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31     : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_image_size;

    /* 0x280 : awb_grid_size */
    union {
        struct {
            uint32_t awb_grid_width_w  : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t awb_grid_height_w : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t awb_grid_x_max_w  : 6; /* [21:16],        r/w,        0x0 */
            uint32_t reserved_22_23    : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t awb_grid_y_max_w  : 6; /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30_31    : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_grid_size;

    /* 0x284 : awb_r_thre */
    union {
        struct {
            uint32_t awb_r_max_thr_w : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t awb_r_min_thr_w : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_r_thre;

    /* 0x288 : awb_g_thre */
    union {
        struct {
            uint32_t awb_g_max_thr_w : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t awb_g_min_thr_w : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_g_thre;

    /* 0x28C : awb_b_thre */
    union {
        struct {
            uint32_t awb_b_max_thr_w : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15  : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t awb_b_min_thr_w : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31  : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_b_thre;

    /* 0x290 : awb_rgr_gain */
    union {
        struct {
            uint32_t awb_gr_gain_pre : 16; /* [15: 0],        r/w,     0x1000 */
            uint32_t awb_r_gain_pre  : 16; /* [31:16],        r/w,     0x1000 */
        } BF;
        uint32_t WORD;
    } awb_rgr_gain;

    /* 0x294 : awb_bgb_gain */
    union {
        struct {
            uint32_t awb_gb_gain_pre : 16; /* [15: 0],        r/w,     0x1000 */
            uint32_t awb_b_gain_pre  : 16; /* [31:16],        r/w,     0x1000 */
        } BF;
        uint32_t WORD;
    } awb_bgb_gain;

    /* 0x298 : awb_rgr_offset */
    union {
        struct {
            uint32_t awb_gr_offset_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t awb_r_offset_pre  : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_rgr_offset;

    /* 0x29C : awb_bgb_offset */
    union {
        struct {
            uint32_t awb_gb_offset_pre : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t awb_b_offset_pre  : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_31    : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_bgb_offset;

    /* 0x2A0 : cfa_int_1 */
    union {
        struct {
            uint32_t reg_cfa_fringe_on_w : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_31       : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cfa_int_1;

    /* 0x2a4  reserved */
    uint8_t RESERVED0x2a4[4];

