RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle_reg.h
    /* 0x2A8 : digital_rgr_gain */
    union {
        struct {
            uint32_t digital_gr_gain_pre : 16; /* [15: 0],        r/w,     0x1000 */
            uint32_t digital_r_gain_pre  : 16; /* [31:16],        r/w,     0x1000 */
        } BF;
        uint32_t WORD;
    } digital_rgr_gain;

    /* 0x2AC : digital_bgb_gain */
    union {
        struct {
            uint32_t digital_gb_gain_pre : 16; /* [15: 0],        r/w,     0x1000 */
            uint32_t digital_b_gain_pre  : 16; /* [31:16],        r/w,     0x1000 */
        } BF;
        uint32_t WORD;
    } digital_bgb_gain;

    /* 0x2b0  reserved */
    uint8_t RESERVED0x2b0[12];

    /* 0x2BC : ae_roi_x */
    union {
        struct {
            uint32_t ae_roi_start_x_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15     : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t ae_roi_width_pre   : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31     : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ae_roi_x;

    /* 0x2C0 : ae_roi_y */
    union {
        struct {
            uint32_t ae_roi_start_y_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15     : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t ae_roi_height_pre  : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31     : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ae_roi_y;

    /* 0x2C4 : ae_image_size */
    union {
        struct {
            uint32_t ae_image_width_pre  : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15      : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t ae_image_height_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31      : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ae_image_size;

    /* 0x2C8 : ae_grid_size */
    union {
        struct {
            uint32_t ae_grid_width_pre     : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t ae_grid_height_pre    : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t ae_grid_y_max_pre     : 4; /* [19:16],        r/w,        0x0 */
            uint32_t ae_grid_x_max_pre     : 4; /* [23:20],        r/w,        0x0 */
            uint32_t new_ae_sta_enable_w   : 1; /* [   24],        r/w,        0x0 */
            uint32_t ae_switch_bank_en_pre : 1; /* [   25],        r/w,        0x1 */
            uint32_t ae_hist_en_pre        : 1; /* [   26],        r/w,        0x1 */
            uint32_t ae_hist_mode_pre      : 1; /* [   27],        r/w,        0x1 */
            uint32_t ae_hist_roi_en_pre    : 1; /* [   28],        r/w,        0x0 */
            uint32_t reserved_29_31        : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ae_grid_size;

    /* 0x2CC : ae_coeff */
    union {
        struct {
            uint32_t ae_ysum_coeff_r_pre : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t ae_ysum_coeff_g_pre : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t ae_ysum_coeff_b_pre : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reserved_24_31      : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ae_coeff;

    /* 0x2D0 : ae2_roi_x */
    union {
        struct {
            uint32_t ae_hist_x_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t ae_hist_x_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ae2_roi_x;

    /* 0x2D4 : ae2_roi_y */
    union {
        struct {
            uint32_t ae_hist_y_max_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t ae_hist_y_min_pre : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ae2_roi_y;

    /* 0x2d8  reserved */
    uint8_t RESERVED0x2d8[16];

    /* 0x2E8 : ae_status */
    union {
        struct {
            uint32_t reserved_0_3    : 4; /* [ 3: 0],       rsvd,        0x0 */
            uint32_t ae_hist_w_cnt_r : 5; /* [ 8: 4],          r,        0x0 */
            uint32_t reserved_9_15   : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t blae_buf_idx_r  : 1; /* [   16],          r,        0x0 */
            uint32_t reserved_17_19  : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t blae_w_cnt_r    : 5; /* [24:20],          r,        0x0 */
            uint32_t reserved_25_31  : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ae_status;

    /* 0x2EC : ae_sta_dbg */
    union {
        struct {
            uint32_t ae_grid_cnt       : 7; /* [ 6: 0],          r,        0x0 */
            uint32_t ae_sta_done       : 1; /* [    7],          r,        0x0 */
            uint32_t ae_write_data_cnt : 8; /* [15: 8],          r,        0x0 */
            uint32_t ae_sta_int_flag   : 1; /* [   16],          r,        0x0 */
            uint32_t ae_grid_cnt_max   : 7; /* [23:17],          r,        0x0 */
            uint32_t ae_fifo_full      : 1; /* [   24],          r,        0x0 */
            uint32_t ae_control_status : 4; /* [28:25],          r,        0x0 */
            uint32_t ae_operation_done : 1; /* [   29],          r,        0x0 */
            uint32_t ae_fifo_empty     : 1; /* [   30],          r,        0x0 */
            uint32_t reserved_31       : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ae_sta_dbg;

    /* 0x2f0  reserved */
    uint8_t RESERVED0x2f0[4];

    /* 0x2F4 : awb_sta_dbg1 */
    union {
        struct {
            uint32_t awb_grid_cnt_max   : 11; /* [10: 0],          r,        0x0 */
            uint32_t reserved_11        : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t awb_fifo_full      : 1;  /* [   12],          r,        0x0 */
            uint32_t reserved_13_15     : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t awb_control_status : 4;  /* [19:16],          r,        0x0 */
            uint32_t awb_operation_done : 1;  /* [   20],          r,        0x0 */
            uint32_t awb_fifo_empty     : 1;  /* [   21],          r,        0x0 */
            uint32_t reserved_22_23     : 2;  /* [23:22],       rsvd,        0x0 */
            uint32_t blawb_w_cnt_r      : 5;  /* [28:24],          r,        0x0 */
            uint32_t reserved_29_30     : 2;  /* [30:29],       rsvd,        0x0 */
            uint32_t blawb_buf_idx_r    : 1;  /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_sta_dbg1;

    /* 0x2F8 : awb_sta_dbg0 */
    union {
        struct {
            uint32_t awb_grid_cnt       : 10; /* [ 9: 0],          r,        0x0 */
            uint32_t reserved_10_11     : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t awb_sta_done       : 1;  /* [   12],          r,        0x0 */
            uint32_t reserved_13_15     : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t awb_write_data_cnt : 12; /* [27:16],          r,        0x0 */
            uint32_t awb_sta_int_flag   : 1;  /* [   28],          r,        0x0 */
            uint32_t reserved_29_31     : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb_sta_dbg0;

    /* 0x2FC : dummy */
    union {
        struct {
            uint32_t Reserved_31_0 : 32; /* [31: 0],        r/w, 0xf0f0f0f0 */
        } BF;
        uint32_t WORD;
    } dummy;
};

typedef volatile struct dsp2_middle_reg dsp2_middle_reg_t;

#endif /* __DSP2_MIDDLE_REG_H__ */
